<h2>Soal 1: Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

JAWAB:

Pivot (Reverse Melting) merupakan suatu metode reshaping-data untuk mengubah posisi (memutar) data yang terletak pada baris menjadi kolom (panjang menjadi lebar). Pivot bertujuan untuk menghasilkan suatu representasi data berupa pivot tabel yang singkat dan padat. Pada python, entri index ataupun kolom (bukan value) harus bersifat 'unik' agar dapat dipivot.


Melting (Unpivoting) merupakan suatu metode reshaping-data untuk mengubaj posisi (memutar) data yang terletak pada kolom menjadi baris ( lebar menjadi panjang).  Pada python, melt() akan akan meng-return sebuah dataframe berisi variabel identifikasi dan variabel pengukuran ( Untuk melting pada tabel pivot akan menghasilkan 'Unpivoted Dataframe')

<h2>Soal 2: Data structure Comprehension</h2>

Data yang rapi adalah:
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

JAWAB :

Struktur data pertama merupakan struktur pivot (pivot table). Pada struktur ini, informasi disampaikan berdasarkan irisan posisi antara index dan kolom yang bersangkutan (misalnya untuk Tipe Ujian 'UAS1' dan Mata pelajaran 'Fisika' akan beriris tabelnya pada angka '347', sehingga apabila dilihat berdasarkan judul dari variabel nilai, dapat disimpulkan bahwa Rata-rata waktu belajar untuk Mata Pelajaran Fisika adalah 347 menit.

Struktur data kedua merupakan struktur unpivot. Padaq struktur ini, informasi disampaikan pada satu baris yang sama, dengan petunjuk variabel berdasarkan nama dari masing-masing kolom (Misalnya kita memperhatikan data pada baris index 0 dengan memperhatikan nama dari masing-masing kolom yang bersangkutan, sehingga dapat disimpulkan bahwa rata-rata waktu belajar untuk mata pelajaran 'Fisika' dengan tipe ujian UTS1 adalah 650 menit).

<h2>Soal 3: Reshaping Data 1</h2>

In [ ]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          319                 68
1        UAS1         Fisika                          547                 68
2        UTS2         Fisika                          454                 74
3        UAS2         Fisika                          703                 71
4        UTS1     Matematika                          632                 42
5        UAS1     Matematika                          426                 97
6        UTS2     Matematika                          734                 47
7        UAS2     Matematika                          632                 76
8        UTS1     Statistika                          576                 70
9        UAS1     Statistika                          295                 43
10       UTS2     Statistika                          311                 77
11       UAS2     Statistika                          283                 50

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [ ]:
# code here

pivot_result = df.pivot_table(values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'], index='Tipe Ujian', columns='Mata Pelajaran')
pivot_result

               Rata2 Nilai Ujian             ... Rata2 Waktu Belajar (menit)
Mata Pelajaran            Fisika Matematika  ...                  Matematika Statistika
Tipe Ujian                                   ...
UAS1                          68         97  ...                         426        295
UAS2                          71         76  ...                         632        283
UTS1                          68         42  ...                         632        576
UTS2                          74         47  ...                         734        311

[4 rows x 6 columns]

Expected Result:

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [ ]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
print(df)

print('\n')

# Dataframe df tidak digunakan untuk proses melting, dikarenakan hari di-set sebagai index,
# sehingga key 'Hari' tidak akan tersimpan sebagai variabel hasil

# Maka digunakan pd.DataFrame(data) untuk proses melting
pd.melt(pd.DataFrame(data), id_vars = 'Hari', value_vars = ['Kebun Binatang','Dufan','Disney','Bali'], var_name = 'Tempat Hiburan', value_name = 'Hasil')

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

     Hari  Tempat Hiburan  Hasil
0   Sabtu  Kebun Binatang    271
1  Minggu  Kebun Binatang    399
2   Sabtu           Dufan    501
3  Minggu           Dufan    700
4   Sabtu          Disney   1000
5  Minggu          Disney   1001
6   Sabtu            Bali    900
7  Minggu            Bali    803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

Expected Result:

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Soal 5: Pivoting and Aggregating</h2>

In [ ]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result:

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)

In [ ]:
#Code here

df.pivot_table( values='Jumlah Peserta', index = 'Tipe Ujian', columns = 'Mata Pelajaran', aggfunc= 'sum' )

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14